{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"nb_filter": 32, "input_dtype": "float32", "name": "convolution2d_1", "batch_input_shape": [null, 160, 320, 3], "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "trainable": true, "bias": true, "nb_row": 3, "W_regularizer": null, "nb_col": 3, "subsample": [1, 1], "activity_regularizer": null, "border_mode": "valid", "activation": "linear", "b_regularizer": null, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "name": "maxpooling2d_1", "pool_size": [4, 4], "dim_ordering": "tf", "strides": [4, 4]}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "name": "convolution2d_2", "bias": true, "W_constraint": null, "trainable": true, "W_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "init": "glorot_uniform", "subsample": [1, 1], "nb_col": 3, "b_regularizer": null, "border_mode": "valid", "activation": "linear", "activity_regularizer": null, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "name": "maxpooling2d_2", "pool_size": [4, 4], "dim_ordering": "tf", "strides": [4, 4]}}, {"class_name": "Dropout", "config": {"p": 0.75, "name": "dropout_2", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias": true, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 256, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "input_dim": null, "b_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "bias": true, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 1, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "input_dim": null, "b_constraint": null}}]}