{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "activation": "linear", "nb_filter": 32, "trainable": true, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "nb_col": 3, "name": "convolution2d_1", "border_mode": "valid", "activity_regularizer": null, "input_dtype": "float32", "nb_row": 3, "b_constraint": null, "batch_input_shape": [null, 80, 320, 3], "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [4, 4], "trainable": true, "dim_ordering": "tf", "strides": [4, 4], "border_mode": "valid", "name": "maxpooling2d_1"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "activation": "linear", "nb_filter": 32, "nb_col": 3, "trainable": true, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "name": "convolution2d_2", "border_mode": "valid", "activity_regularizer": null, "nb_row": 3, "b_constraint": null, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [4, 4], "trainable": true, "dim_ordering": "tf", "strides": [4, 4], "border_mode": "valid", "name": "maxpooling2d_2"}}, {"class_name": "Dropout", "config": {"p": 0.75, "trainable": true, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "activation": "linear", "nb_filter": 64, "nb_col": 3, "trainable": true, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "name": "convolution2d_3", "border_mode": "same", "activity_regularizer": null, "nb_row": 3, "b_constraint": null, "subsample": [1, 1]}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "bias": true, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "name": "dense_1", "output_dim": 1024, "activity_regularizer": null, "input_dim": null, "b_constraint": null}}, {"class_name": "Dense", "config": {"activation": "linear", "bias": true, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "name": "dense_2", "output_dim": 256, "activity_regularizer": null, "input_dim": null, "b_constraint": null}}, {"class_name": "Dense", "config": {"activation": "linear", "bias": true, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "name": "dense_3", "output_dim": 1, "activity_regularizer": null, "input_dim": null, "b_constraint": null}}], "keras_version": "1.1.2"}