{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_col": 3, "batch_input_shape": [null, 80, 220, 3], "activation": "linear", "subsample": [1, 1], "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 32, "name": "convolution2d_1", "b_constraint": null, "b_regularizer": null, "border_mode": "valid", "trainable": true, "W_constraint": null, "bias": true, "input_dtype": "float32", "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"strides": [4, 4], "border_mode": "valid", "pool_size": [4, 4], "dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_1"}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null, "dim_ordering": "tf", "trainable": true, "nb_filter": 32, "name": "convolution2d_2", "b_constraint": null, "b_regularizer": null, "bias": true, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"strides": [4, 4], "border_mode": "valid", "pool_size": [4, 4], "dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_2"}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_2", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.75, "name": "dropout_2", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "W_regularizer": null, "name": "dense_1", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "output_dim": 256, "activity_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_3", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "W_regularizer": null, "name": "dense_2", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "output_dim": 1, "activity_regularizer": null, "init": "glorot_uniform"}}], "keras_version": "1.1.2"}