{"config": [{"config": {"W_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "trainable": true, "dim_ordering": "tf", "nb_filter": 32, "batch_input_shape": [null, 160, 320, 3], "W_constraint": null, "name": "convolution2d_1", "nb_col": 3, "bias": true, "input_dtype": "float32", "nb_row": 3, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_1", "border_mode": "valid", "pool_size": [4, 4], "trainable": true, "dim_ordering": "tf", "strides": [4, 4]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "trainable": true, "dim_ordering": "tf", "nb_filter": 32, "bias": true, "b_regularizer": null, "name": "convolution2d_2", "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_2", "border_mode": "valid", "pool_size": [4, 4], "trainable": true, "dim_ordering": "tf", "strides": [4, 4]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.75}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "input_dim": null, "activity_regularizer": null, "output_dim": 256, "W_constraint": null, "bias": true, "b_regularizer": null, "name": "dense_1", "activation": "linear", "b_constraint": null, "init": "glorot_uniform", "trainable": true}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "input_dim": null, "activity_regularizer": null, "output_dim": 1, "W_constraint": null, "bias": true, "b_regularizer": null, "name": "dense_2", "activation": "linear", "b_constraint": null, "init": "glorot_uniform", "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}