{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"b_constraint": null, "input_dtype": "float32", "activation": "linear", "border_mode": "valid", "batch_input_shape": [null, 80, 320, 3], "bias": true, "b_regularizer": null, "nb_filter": 32, "W_regularizer": null, "nb_row": 3, "nb_col": 3, "trainable": true, "name": "convolution2d_1", "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "pool_size": [4, 4], "strides": [4, 4]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "activation": "linear", "border_mode": "valid", "trainable": true, "bias": true, "b_regularizer": null, "nb_filter": 32, "W_regularizer": null, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "name": "convolution2d_2", "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "pool_size": [4, 4], "strides": [4, 4]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.75}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "output_dim": 256, "activation": "linear", "init": "glorot_uniform", "bias": true, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "trainable": true, "name": "dense_1", "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"b_constraint": null, "output_dim": 1, "activation": "linear", "init": "glorot_uniform", "bias": true, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "trainable": true, "name": "dense_2", "W_constraint": null, "activity_regularizer": null}}]}