{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_constraint": null, "nb_row": 3, "subsample": [1, 1], "name": "convolution2d_1", "dim_ordering": "tf", "b_constraint": null, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "nb_filter": 32, "input_dtype": "float32", "batch_input_shape": [null, 80, 220, 3], "bias": true, "activation": "linear", "border_mode": "valid"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [4, 4], "trainable": true, "strides": [4, 4], "name": "maxpooling2d_1", "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_constraint": null, "nb_row": 3, "subsample": [1, 1], "name": "convolution2d_2", "dim_ordering": "tf", "b_constraint": null, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "nb_col": 3, "nb_filter": 32, "b_regularizer": null, "activation": "linear", "border_mode": "valid"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [4, 4], "trainable": true, "strides": [4, 4], "name": "maxpooling2d_2", "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.75}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "name": "dense_1", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "output_dim": 256, "bias": true, "activation": "linear", "input_dim": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "tanh", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "name": "dense_2", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "output_dim": 1, "bias": true, "activation": "linear", "input_dim": null}}], "keras_version": "1.1.2"}