{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_col": 3, "subsample": [1, 1], "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_1", "init": "glorot_uniform", "nb_filter": 256, "bias": true, "input_dtype": "float32", "dim_ordering": "tf", "trainable": true, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "activation": "linear", "nb_row": 3, "batch_input_shape": [null, 80, 320, 3], "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [4, 4], "pool_size": [4, 4], "border_mode": "valid", "name": "maxpooling2d_1", "dim_ordering": "tf", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "subsample": [1, 1], "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_2", "init": "glorot_uniform", "nb_filter": 256, "bias": true, "dim_ordering": "tf", "trainable": true, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "activation": "linear", "nb_row": 3, "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [4, 4], "pool_size": [4, 4], "border_mode": "valid", "name": "maxpooling2d_2", "dim_ordering": "tf", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.75}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "bias": true, "trainable": true, "b_constraint": null, "output_dim": 256, "W_regularizer": null, "activity_regularizer": null, "activation": "linear", "input_dim": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "bias": true, "trainable": true, "b_constraint": null, "output_dim": 1, "W_regularizer": null, "activity_regularizer": null, "activation": "linear", "input_dim": null, "W_constraint": null}}], "keras_version": "1.1.2"}