{"keras_version": "1.1.2", "config": [{"config": {"nb_filter": 32, "nb_row": 3, "nb_col": 3, "dim_ordering": "tf", "bias": true, "name": "convolution2d_1", "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "border_mode": "valid", "input_dtype": "float32", "W_regularizer": null, "b_constraint": null, "batch_input_shape": [null, 80, 320, 3], "activity_regularizer": null, "activation": "linear", "subsample": [1, 1], "trainable": true}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_1", "pool_size": [4, 4], "strides": [4, 4]}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"nb_filter": 32, "nb_row": 3, "nb_col": 3, "dim_ordering": "tf", "bias": true, "name": "convolution2d_2", "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "border_mode": "valid", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "subsample": [1, 1], "trainable": true}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_2", "pool_size": [4, 4], "strides": [4, 4]}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.75, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias": true, "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "name": "dense_1", "input_dim": null, "W_regularizer": null, "activity_regularizer": null, "output_dim": 256, "activation": "linear", "b_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"bias": true, "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "name": "dense_2", "input_dim": null, "W_regularizer": null, "activity_regularizer": null, "output_dim": 1, "activation": "linear", "b_constraint": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential"}