{"config": [{"config": {"init": "glorot_uniform", "b_regularizer": null, "nb_filter": 256, "b_constraint": null, "nb_row": 3, "name": "convolution2d_1", "bias": true, "border_mode": "valid", "trainable": true, "input_dtype": "float32", "W_regularizer": null, "W_constraint": null, "activation": "linear", "nb_col": 3, "batch_input_shape": [null, 80, 320, 3], "subsample": [1, 1], "dim_ordering": "tf", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [4, 4], "strides": [4, 4], "name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "b_regularizer": null, "nb_filter": 256, "nb_row": 3, "name": "convolution2d_2", "bias": true, "border_mode": "valid", "trainable": true, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "activation": "linear", "nb_col": 3, "subsample": [1, 1], "dim_ordering": "tf", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [4, 4], "strides": [4, 4], "name": "maxpooling2d_2", "border_mode": "valid", "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "p": 0.75, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "b_regularizer": null, "name": "dense_1", "bias": true, "W_regularizer": null, "b_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "input_dim": null, "output_dim": 256, "W_constraint": null}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "b_regularizer": null, "name": "dense_2", "bias": true, "W_regularizer": null, "b_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "input_dim": null, "output_dim": 1, "W_constraint": null}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}