{"config": [{"config": {"b_regularizer": null, "border_mode": "valid", "trainable": true, "activation": "linear", "nb_row": 5, "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "batch_input_shape": [null, 107, 320, 3], "W_regularizer": null, "input_dtype": "float32", "init": "glorot_uniform", "bias": true, "name": "conv1_1", "nb_col": 5, "nb_filter": 24, "subsample": [2, 2], "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "trainable": true, "activation": "linear", "nb_row": 5, "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "bias": true, "name": "conv2_1", "nb_col": 5, "nb_filter": 36, "subsample": [2, 2], "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "trainable": true, "activation": "linear", "nb_row": 5, "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "bias": true, "name": "conv3_1", "nb_col": 5, "nb_filter": 48, "subsample": [2, 2], "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "trainable": true, "activation": "linear", "nb_row": 3, "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "bias": true, "name": "conv4_1", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "trainable": true, "activation": "linear", "nb_row": 3, "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "bias": true, "name": "conv4_2", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_0", "b_constraint": null, "input_dim": null, "output_dim": 1164, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_6", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_1", "b_constraint": null, "input_dim": null, "output_dim": 100, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_7", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_2", "b_constraint": null, "input_dim": null, "output_dim": 50, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_8", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_3", "b_constraint": null, "input_dim": null, "output_dim": 10, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_9", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_4", "b_constraint": null, "input_dim": null, "output_dim": 1, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}