{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 80, 220, 3], "b_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 32, "bias": true, "activity_regularizer": null, "name": "convolution2d_1", "nb_col": 3, "border_mode": "valid", "nb_row": 3, "input_dtype": "float32", "trainable": true, "W_constraint": null, "activation": "linear", "W_regularizer": null, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [4, 4], "dim_ordering": "tf", "strides": [4, 4], "name": "maxpooling2d_1", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "tanh"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "b_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 32, "name": "convolution2d_2", "activity_regularizer": null, "bias": true, "nb_row": 3, "border_mode": "valid", "trainable": true, "W_constraint": null, "activation": "linear", "W_regularizer": null, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [4, 4], "dim_ordering": "tf", "strides": [4, 4], "name": "maxpooling2d_2", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.75}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "tanh"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "name": "dense_1", "trainable": true, "output_dim": 256, "W_constraint": null, "activation": "linear", "input_dim": null, "W_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "tanh"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "name": "dense_2", "trainable": true, "output_dim": 1, "W_constraint": null, "activation": "linear", "input_dim": null, "W_regularizer": null, "b_constraint": null}}]}