{"keras_version": "1.1.2", "config": [{"config": {"nb_row": 3, "input_dtype": "float32", "b_regularizer": null, "activation": "linear", "b_constraint": null, "border_mode": "valid", "trainable": true, "nb_col": 3, "bias": true, "W_constraint": null, "nb_filter": 32, "activity_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "name": "convolution2d_1", "W_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"strides": [4, 4], "name": "maxpooling2d_1", "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "pool_size": [4, 4]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"nb_row": 3, "name": "convolution2d_2", "b_regularizer": null, "activation": "linear", "b_constraint": null, "border_mode": "valid", "trainable": true, "nb_col": 3, "bias": true, "W_constraint": null, "nb_filter": 32, "activity_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"strides": [4, 4], "name": "maxpooling2d_2", "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "pool_size": [4, 4]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.75}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"output_dim": 256, "name": "dense_1", "activation": "linear", "b_constraint": null, "trainable": true, "b_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"output_dim": 1, "name": "dense_2", "activation": "linear", "b_constraint": null, "trainable": true, "b_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}