{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"border_mode": "valid", "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform", "b_regularizer": null, "name": "convolution2d_1", "nb_filter": 32, "W_regularizer": null, "bias": true, "W_constraint": null, "trainable": true, "input_dtype": "float32", "nb_col": 3, "nb_row": 3, "activation": "linear", "activity_regularizer": null, "b_constraint": null, "batch_input_shape": [null, 80, 320, 3]}}, {"class_name": "MaxPooling2D", "config": {"strides": [4, 4], "border_mode": "valid", "trainable": true, "name": "maxpooling2d_1", "pool_size": [4, 4], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform", "b_regularizer": null, "name": "convolution2d_2", "nb_filter": 32, "W_regularizer": null, "bias": true, "W_constraint": null, "trainable": true, "nb_col": 3, "nb_row": 3, "activation": "linear", "activity_regularizer": null, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [4, 4], "border_mode": "valid", "trainable": true, "name": "maxpooling2d_2", "pool_size": [4, 4], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.75, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_regularizer": null, "name": "dense_1", "input_dim": null, "bias": true, "W_constraint": null, "output_dim": 256, "trainable": true, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "b_constraint": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_regularizer": null, "name": "dense_2", "input_dim": null, "bias": true, "W_constraint": null, "output_dim": 1, "trainable": true, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "b_constraint": null}}], "keras_version": "1.1.2"}